Автоматизированная_проверка_конфигураций_демо/src/InformationRegisters/ИС_ЗаданияПроверки/ИС_ЗаданияПроверки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИС_ЗаданияПроверки</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.ИС_СостоянияЗадачПроверок</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатВыполнения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>НомерЗадания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Автоматизированная_проверка_конфигураций_демо/src/Enums/ИС_СостоянияЗадачПроверок/ИС_СостоянияЗадачПроверок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИС_СостоянияЗадачПроверок</name>
  <enumValues>
    <name>ВОчереди</name>
  </enumValues>
  <enumValues>
    <name>ВыполняетсяПроверка</name>
  </enumValues>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
</mdclass:Enum>

Автоматизированная_проверка_конфигураций_демо/src/Catalogs/Конфигурации/Конфигурации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Конфигурации</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>КаталогКонфигурации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаЗапускаПлатформы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьВОтчетность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоОбычныйРежим</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключенияБезПривязки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаКонфигурацию</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьОбъектыСПрефиксомУдалить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрироватьОшибкиВСППР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучатьОтветственныхЗаМетаданныеИзСППР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппироватьОшибкиПоОтветственному</name>
    <type>
      <types>EnumRef.ВидыГруппировокСППР</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКонфигурацииСППР</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияКонфигурацииСППР</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнениеКТекстуОшибкиСППР</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогХранилища</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательХранилища</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольХранилища</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Расписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПроверки</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АктивностьРасписания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЗапуска</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПроверкиВручную</name>
    <type>
      <types>CatalogRef.ВариантыПроверки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПроверкиПоРасписанию</name>
    <type>
      <types>CatalogRef.ВариантыПроверки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоБиблиотека</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнятьРассылкуРезультатовПроверки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьОсобенностиПоРасписанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлуВыгрузкиОсобенностей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РасписаниеВыгрузкиОсобенностей</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательВыгрузкиОсобенностей</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыгрузкиОсобенностей</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширеннаяПроверкаПоДополнительнымТребованиям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонПисьма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрироватьВсеОшибкиКакОсобенностиПоРасписанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьАвтораОсобенности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <comment>0 - Конфигурация, 1 - Расширения, 2 - Конфигурация и расширения</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИС_ИспользоватьКаталогФайловXML</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИС_КаталогФайловXML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИС_GUID</name>
    <comment>ИнфоСофт, Фоминых В.С., 23.09.2018</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсключенияИзПроверки</name>
    <attributes>
      <name>Использовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидИсключения</name>
      <type>
        <types>EnumRef.ВидыИсключенийИзПроверки</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Расширение</name>
      <type>
        <types>CatalogRef.Расширения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Библиотеки</name>
    <attributes>
      <name>БиблиотечнаяКонфигурация</name>
      <type>
        <types>CatalogRef.Конфигурации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПричиныОсобенностей</name>
    <attributes>
      <name>ПричинаОсобенности</name>
      <type>
        <types>CatalogRef.ПричиныОсобенности</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расписания</name>
    <attributes>
      <name>АктивностьРасписания</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантПроверкиПоРасписанию</name>
      <type>
        <types>CatalogRef.ВариантыПроверки</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантПроверкиПоРасписаниюСтрокой</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяЗапуска</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПользовательПроверки</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Расписание</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>РегистрироватьВсеОшибкиКакОсобенностиПоРасписанию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонПисьма</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расширения</name>
    <attributes>
      <name>Расширение</name>
      <type>
        <types>CatalogRef.Расширения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Автоматизированная_проверка_конфигураций_демо/src/CommonModules/ИС_МеханизмыПроверкиКонфигураций/Module.bsl
Функция ПолучитьПроверяемуюКонфигурациюПоGUID(GUID) Экспорт
	Результат = Справочники.Конфигурации.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Конфигурации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Конфигурации КАК Конфигурации
		|ГДЕ
		|	Конфигурации.ИС_GUID = &ИС_GUID";
	
	Запрос.УстановитьПараметр("ИС_GUID", GUID);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Результат = ВыборкаДетальныеЗаписи.Ссылка; 
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ЗапуститьПроверкуСВозвратомРезультата(GUID) Экспорт
	ПроверяемаяКонфигурация = ПолучитьПроверяемуюКонфигурациюПоGUID(GUID);
	Если НЕ ЗначениеЗаполнено(ПроверяемаяКонфигурация) Тогда
		Возврат СтрШаблон("no configuration match by ID %1", GUID);	
	КонецЕсли;
	
	НомерЗадания = РегистрыСведений.ИС_ЗаданияПроверки.ПолучитьТекущийНомерЗадания();
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("НомерЗадания", НомерЗадания);
	СтруктураПараметров.Вставить("Конфигурация", ПроверяемаяКонфигурация);
	СтруктураПараметров.Вставить("Состояние", 	 Перечисления.ИС_СостоянияЗадачПроверок.ВОчереди);
	СтруктураПараметров.Вставить("ДатаДобавления", ТекущаяДата());

	ЗаписиОчереди = РегистрыСведений.ИС_ЗаданияПроверки.ПолучитьНаборЗаписей(СтруктураПараметров);
	Для каждого Запись из ЗаписиОчереди Цикл
		Если Запись.Состояние = Перечисления.ИС_СостоянияЗадачПроверок.ВыполняетсяПроверка Тогда
			Возврат СтрШаблон("A configuration check is already in progress <%1 (%2)>", ПроверяемаяКонфигурация, GUID);	
		ИначеЕсли Запись.Состояние = Перечисления.ИС_СостоянияЗадачПроверок.ВОчереди Тогда
			Возврат СтрШаблон("Verification of configuration <%1 (%2)> added in queue", ПроверяемаяКонфигурация, GUID);	
		КонецЕсли;
	КонецЦикла;
	
	Запись = ЗаписиОчереди.Добавить();
	ЗаполнитьЗначенияСвойств(Запись, СтруктураПараметров);
	ЗаписиОчереди.Записать();
		
	Возврат СтрШаблон("Verification of configuration <%1 (%2)> added in queue", ПроверяемаяКонфигурация, GUID);
КонецФункции

Процедура ЗаполнитьПараметрыОбработки(ОбработкаЗапускПроверки, Конфигурация)
	ОбработкаЗапускПроверки.Конфигурация = Конфигурация;	
	ОбработкаЗапускПроверки.Версия = НайтиПоследнююВерсию(Конфигурация, ложь);
	
	ОбработкаЗапускПроверки.КаталогКонфигурации = Конфигурация.КаталогКонфигурации;
	ОбработкаЗапускПроверки.КаталогКонфигурацииКопия = ОбработкаЗапускПроверки.КаталогКонфигурации;
	ОбработкаЗапускПроверки.Пользователь = Конфигурация.Пользователь;
	ОбработкаЗапускПроверки.Пароль = Конфигурация.Пароль;
	
	ОбработкаЗапускПроверки.ИС_КаталогХранилища 	 = Конфигурация.КаталогХранилища;
	ОбработкаЗапускПроверки.ИС_ПользовательХранилища = Конфигурация.ПользовательХранилища;
	ОбработкаЗапускПроверки.ИС_ПарольХранилища       = Конфигурация.ПарольХранилища;
	
	ОбработкаЗапускПроверки.ИС_ФлажокВыполнятьРассылкуРезультатовПроверки = Конфигурация.ВыполнятьРассылкуРезультатовПроверки;

	Если ЗначениеЗаполнено(ОбработкаЗапускПроверки.ИС_КаталогХранилища) Тогда
		ОбработкаЗапускПроверки.ИС_ФлажокЗагрузитьКонфигурациюИзХранилища = Истина;
	КонецЕсли;
	
	ОбработкаЗапускПроверки.Сценарий = Конфигурация.Сценарий;
	
КонецПроцедуры

Функция ЗаполнитьСписокРасширений(Конфигурация, Сценарий)
	СписокРасширений = Новый СписокЗначений;
	ПустаяСсылкаРасширение = Справочники.Расширения.ПустаяСсылка();
	
	Если СписокРасширений = Неопределено Тогда
		
		СписокРасширений = Новый СписокЗначений;
		Если Сценарий = 0 Или Сценарий = 2 Тогда
			СписокРасширений.Добавить(ПустаяСсылкаРасширение);
		КонецЕсли;
		Если Сценарий >= 1 Тогда
			Расширения = Конфигурация.Расширения;
			Для Каждого СтрокаТаблицыРасширения Из Расширения Цикл
				СписокРасширений.Добавить(СтрокаТаблицыРасширения.Расширение);
			КонецЦикла;
		КонецЕсли;
		Возврат СписокРасширений;
	
	КонецЕсли;
	
	ЭлементСпискаРасширения = СписокРасширений.НайтиПоЗначению(ПустаяСсылкаРасширение);
	
	Если Сценарий = 0 Тогда
		
		СписокРасширений.Очистить();
		СписокРасширений.Добавить(ПустаяСсылкаРасширение);
		
	ИначеЕсли Сценарий = 1 Тогда
		
		Если ЭлементСпискаРасширения <> Неопределено Тогда
			СписокРасширений.Удалить(ЭлементСпискаРасширения);
		КонецЕсли;
		
	Иначе
		
		Если ЭлементСпискаРасширения = Неопределено Тогда
			СписокРасширений.Добавить(ПустаяСсылкаРасширение);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СписокРасширений;
КонецФункции

Функция ПолучитьНастройкиХранилища(ОбработкаЗапускПроверки)
	
	НастройкиХранилища = Новый Структура;
	Если ОбработкаЗапускПроверки.ИС_ФлажокЗагрузитьКонфигурациюИзХранилища Тогда
		НастройкиХранилища.Вставить("КаталогХранилища", ОбработкаЗапускПроверки.ИС_КаталогХранилища);
		НастройкиХранилища.Вставить("ПользовательХранилища", ОбработкаЗапускПроверки.ИС_ПользовательХранилища);
		НастройкиХранилища.Вставить("ПарольХранилища", ОбработкаЗапускПроверки.ИС_ПарольХранилища);
	КонецЕсли;
	
	Возврат НастройкиХранилища;
	
КонецФункции

Процедура ЗафиксироватьОшибкуПриВыполненииПроверки(Конфигурация, Обработка, Статус = "")
	
	Если ЗначениеЗаполнено(Статус) Тогда
		Зафиксировать(Конфигурация, УровеньЖурналаРегистрации.Ошибка, Статус, Обработка.СтруктураПроверки.ЖурналПроверки);
	КонецЕсли;
	
	Обработка.ЗаписатьДокументПроверкиВерсии("Ошибка");
	
	ТекстПроверкаНеВыполнена = НСтр("ru='Во время проверки возникли ошибки. Проверка не выполнена.'");
	
	Если Обработка.ИС_ФлажокВыполнятьРассылкуРезультатовПроверки Тогда
		РаботаСПочтовымиСообщениями.ОтправитьПисьмаОтветственным(Обработка.ПроверкаВерсии, Обработка.СтруктураПроверки.ЖурналПроверки, Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьПроверкуКонфигурации(Конфигурация) Экспорт
	ЗаписьЖурналаРегистрации("Запуск проверки конфигурации", УровеньЖурналаРегистрации.Информация,,, 
							СтрШаблон("Старт проверки конфигурации %1", Конфигурация));
							
	ОбработкаЗапускПроверки = Обработки.ЗапускПроверки.Создать();
	ЗаполнитьПараметрыОбработки(ОбработкаЗапускПроверки, Конфигурация);
	
	ВариантПроверки = Конфигурация.ВариантПроверкиВручную;
	КэшУстановленныхФлажковТребований = ЗаполнитьТаблицуТребований(Конфигурация, ВариантПроверки);
	СписокРасширений = ЗаполнитьСписокРасширений(Конфигурация, ОбработкаЗапускПроверки.Сценарий);
	
	КэшУстановленныхФлажковСпискаОбъектов = Неопределено;
	ОбработкаЗапускПроверки.ПрочитатьОбъекты(КэшУстановленныхФлажковСпискаОбъектов);
	
	СоставОбъектовДляПроверки = ОбработкаЗапускПроверки.ПолучитьСоставОбъектовДляПроверки(Ложь, КэшУстановленныхФлажковСпискаОбъектов, СписокРасширений);
	ПроверитьВсеОбъекты = ?(СоставОбъектовДляПроверки.Количество() = 0, 0, 1);
	
	ОбработкаЗапускПроверки.СоздатьДокументПроверкиВерсии();
	СписокТребований = ОбработкаЗапускПроверки.ПолучитьСписокТребований(КэшУстановленныхФлажковТребований, 1); // 2 - проверка по ранее собранным данным
	КоличествоТребований = СписокТребований.Количество();
	
	ФлагПроверитьВсе = (ПроверитьВсеОбъекты = 0);
	СоставОбъектовДляПроверки = ОбработкаЗапускПроверки.ПолучитьСоставОбъектовДляПроверки(ФлагПроверитьВсе, КэшУстановленныхФлажковСпискаОбъектов, СписокРасширений);
	ОбработкаЗапускПроверки.ЗаписатьДокументПроверкиВерсии(, Ложь);
	
	ОбработкаЗапускПроверки.СтруктураПроверки.Вставить("ВариантПроверки", ?(КоличествоТребований = "все",
		НСтр("ru='Полная'"),
		СтрШаблон(НСтр("ru='Выборочная (%1)'"), КоличествоТребований)));
		
	ВерсияМетаданных = Метаданные.Версия;
	Текст = НСтр("ru='Начало проверки. Версия АПК: %1. Выбрано требований: %2'");
	Текст = СтрШаблон(Текст, ВерсияМетаданных, КоличествоТребований);
	
	Зафиксировать(Конфигурация.Наименование, УровеньЖурналаРегистрации.Информация, Текст, ОбработкаЗапускПроверки.СтруктураПроверки.ЖурналПроверки);
	Если ФлагПроверитьВсе Тогда
		КэшУстановленныхФлажковСпискаОбъектов.Очистить();
	КонецЕсли;
	
	НастройкиХранилища = ПолучитьНастройкиХранилища(ОбработкаЗапускПроверки);
	
	ПроверитьПлатформуДляЗапускаПроверки = Истина;
	ПроверитьСоединениеСБазой = Истина;
	ЗагрузитьКонфигурациюИзХранилища = Истина;
	ПроверитьВерсиюКонфигурации = Истина;
	ОпределятьРежимЗапуска = Истина;
	ОчищатьСобранныеДанные = Ложь;
	ПостроитьСтруктуру = Ложь;
	ЭтапыПроверкиПоТребованиям = ОбработкаЗапускПроверки.ПолучитьЭтапыПроверкиПоТребованиям(СписокТребований);
	
	ПараметрыПроверки = ОбработкаЗапускПроверки.ЗаполнитьПараметрыПроверки(ЭтапыПроверкиПоТребованиям,
		ПроверитьПлатформуДляЗапускаПроверки,
		ПроверитьСоединениеСБазой,
		ЗагрузитьКонфигурациюИзХранилища,
		НастройкиХранилища,
		ПроверитьВерсиюКонфигурации,
		ОпределятьРежимЗапуска,
		ОчищатьСобранныеДанные,
		ПостроитьСтруктуру,
		Истина);
		
	Статус = ОбработкаЗапускПроверки.ЗапуститьПроверку(СписокТребований, СоставОбъектовДляПроверки, ПараметрыПроверки);
	ОбработкаЗапускПроверки.ОчиститьМассивВременныхФайлов();
	Если НЕ ПустаяСтрока(Статус) Тогда
		ЗафиксироватьОшибкуПриВыполненииПроверки(Конфигурация, ОбработкаЗапускПроверки, Статус);
		Возврат;
	КонецЕсли;
	
	ОбработкаЗапускПроверки.ЗаписатьДокументПроверкиВерсии("Успешно");

	КоличествоОшибок = ОбработкаЗапускПроверки.СтруктураПроверки.ОбнаруженоОшибок;
	Если КоличествоОшибок = Неопределено Тогда
		КоличествоОшибок = ПолучитьОбщееКоличествоОшибокПослеПроверки(ОбработкаЗапускПроверки.Версия);
	КонецЕсли;
	
	Если КоличествоОшибок = 0 Тогда
		ТекстКоличествоОшибок = НСтр("ru='Ошибок не обнаружено'");
	Иначе
		ТекстКоличествоОшибок = СтрШаблон(НСтр("ru='Количество обнаруженных ошибок: %1'"), КоличествоОшибок);
	КонецЕсли;
	
	//Если ОбработкаЗапускПроверки.ИС_ФлажокВыполнятьРассылкуРезультатовПроверки Тогда
		РаботаСПочтовымиСообщениями.ОтправитьПисьмаОтветственным(ОбработкаЗапускПроверки.ПроверкаВерсии, ТекстКоличествоОшибок);
	//КонецЕсли;

КонецПроцедуры

Процедура ВыполнитьРегламентнуюПроверку() Экспорт
	НачалоВыполнения = ТекущаяДата();
	НомерЗадания = РегистрыСведений.ИС_ЗаданияПроверки.ПолучитьТекущийНомерЗадания();
	РегистрыСведений.ИС_ЗаданияПроверки.УвеличитьНомерЗадания(НомерЗадания);
	
	// получаем конфигурации из очереди
	Конфигурации = РегистрыСведений.ИС_ЗаданияПроверки.ПолучитьКонфигурацииИзОчереди(НомерЗадания);
	РегистрыСведений.ИС_ЗаданияПроверки.УстановитьСтатусВыполняется(Конфигурации, НомерЗадания);
	
	МассивФоновыхЗаданий = Новый Массив;
	КоличествоПотоков = Константы.ИС_КоличествоЛогическихПроцессов.Получить();
	КоличествоПотоков = ?(КоличествоПотоков = 0, 2, КоличествоПотоков);
	
	ВсегоЦиклов = Цел(Конфигурации.Количество()/КоличествоПотоков);
	Остаток = Конфигурации.Количество() - ВсегоЦиклов*КоличествоПотоков;
	
	Для к = 1 по ВсегоЦиклов Цикл
		Для п = 1 по КоличествоПотоков Цикл
			Конфигурация = Конфигурации[(П - 1) + КоличествоПотоков * (К - 1)];
			МассивПараметров = Новый Массив;
			МассивПараметров.Добавить(Конфигурация);
			ФоновоеЗадание = ФоновыеЗадания.Выполнить("ИС_МеханизмыПроверкиКонфигураций.ВыполнитьПроверкуКонфигурации", МассивПараметров, 
														Новый УникальныйИдентификатор, 
														СтрШаблон("Выполнить проверку конфигурации %1", Конфигурация));
			
			МассивФоновыхЗаданий.Добавить(ФоновоеЗадание);
		КонецЦикла;
		
		Если МассивФоновыхЗаданий.Количество() Тогда
			Попытка
				ФоновыеЗадания.ОжидатьЗавершения(МассивФоновыхЗаданий);
			Исключение
				ЗаписьЖурналаРегистрации("Проверка конфигураций", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
		
	МассивФоновыхЗаданий = Новый Массив;	
	Для п = 1 по Остаток Цикл
		Конфигурация = Конфигурации[Конфигурации.Количество()-п];
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(Конфигурация);
		ФоновоеЗадание = ФоновыеЗадания.Выполнить("ИС_МеханизмыПроверкиКонфигураций.ВыполнитьПроверкуКонфигурации", МассивПараметров, 
													Новый УникальныйИдентификатор, 
													СтрШаблон("Выполнить проверку конфигурации %1", Конфигурация));
													
		МассивФоновыхЗаданий.Добавить(ФоновоеЗадание);
	КонецЦикла;
	
	Если МассивФоновыхЗаданий.Количество() Тогда
		Попытка
			ФоновыеЗадания.ОжидатьЗавершения(МассивФоновыхЗаданий);
		Исключение
			ЗаписьЖурналаРегистрации("Проверка конфигураций", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
	РегистрыСведений.ИС_ЗаданияПроверки.УстановитьСтатусЗавершено(Конфигурации, НомерЗадания);
	
	ЗаписьЖурналаРегистрации(СтрШаблон("Завершение обработки: Проверка конфигурации. Время выполнения %1 с.", ТекущаяДата() - НачалоВыполнения), УровеньЖурналаРегистрации.Информация);
КонецПроцедуры
